# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
# Во всех задачах считывайте входные данные через input() и выводите ответ через print().
# Hello, Harry!
str1 = str(input(""))
# print(f"Hello, {str1}!")
print("Hello, ",str1 + "!", sep="")