# Наказание
# Наше развлечение не осталось незамеченным...
# И наказание нам выбрали соответствующее.

# Формат ввода
# В первой строке записано одно натуральное число 
# �
# N
# Во второй строке записана часть наказания.

# Формат вывода
# �
# N строк вида: Я больше никогда не буду писать "<часть наказания>"!


# Ввод
# 2
# Купи слона!

# Вывод
# Я больше никогда не буду писать "Купи слона!"!
# Я больше никогда не буду писать "Купи слона!"!

i = int(input())
с1 = input()

# Экранирование двойных ковычек в python \"{с1}\"
for i in range(i):
    print(f"Я больше никогда не буду писать \"{с1}\"!", sep="")
    i += 1
